#встроенные функции
# переменные
# условия
# циклы
# списки

#Напишите программу, которая принимает на вход два числа и проверяет,
# является ли одно число квадратом другого.

from sunau import AUDIO_FILE_ENCODING_LINEAR_32


num_1 = int(input('введите число 1:'))
num_2 = int(input('введите число 2:'))

if (num_2 == (num_1 ** 2)) and (print(123)): 
    print(True)
else:
    print(False)    

